Дошкольное_учреждение83/src/Catalogs/НоменклатураДел/НоменклатураДел.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НоменклатураДел</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Индекс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияДела</name>
    <type>
      <types>EnumRef.КатегорииДел</types>
    </type>
  </attributes>
  <attributes>
    <name>НомераСтатей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтметкаЭПК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Раздел</name>
    <type>
      <types>CatalogRef.РазделыНоменклатурыДел</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокХранения</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Enums/КатегорииДел/КатегорииДел.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииДел</name>
  <enumValues>
    <name>ВременноеДо10</name>
  </enumValues>
  <enumValues>
    <name>ВременноеСвыше10</name>
  </enumValues>
  <enumValues>
    <name>Постоянное</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Catalogs/ДелаХраненияДокументов/ДелаХраненияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДелаХраненияДокументов</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДелоЗакрыто</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛистов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураДел</name>
    <type>
      <types>CatalogRef.НоменклатураДел</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТома</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Catalogs/НоменклатураДел/ManagerModule.bsl
Процедура ПечатьНоменклатурыДел(ТабДок, ПараметрыПечати) Экспорт
	
	Макет = Справочники.НоменклатураДел.ПолучитьМакет("НоменклатураДел");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НоменклатураДел.Индекс КАК Индекс,
	|	НоменклатураДел.ПолноеНаименование КАК Наименование,
	|	НоменклатураДел.Раздел КАК Раздел,
	|	НоменклатураДел.ОтметкаЭПК КАК ОтметкаЭПК,
	|	НоменклатураДел.НомераСтатей КАК НомераСтатей,
	|	НоменклатураДел.СрокХранения КАК СрокХранения,
	|	НоменклатураДел.Примечание КАК Примечание
	|ИЗ
	|	Справочник.НоменклатураДел КАК НоменклатураДел
	|ГДЕ
	|	НоменклатураДел.Год = &Год
	|	И (НоменклатураДел.Организация = &Организация
	|			ИЛИ &ИспользоватьУчетПоОрганизациям = ЛОЖЬ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Индекс
	|ИТОГИ ПО
	|	Раздел ИЕРАРХИЯ";
	Запрос.УстановитьПараметр("Год", ПараметрыПечати.Год);
	Запрос.УстановитьПараметр("Организация", ПараметрыПечати.Организация);
	Запрос.УстановитьПараметр("ИспользоватьУчетПоОрганизациям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОрганизациям"));
	
	ВыборкаРазделы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка 	 = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока 	 = Макет.ПолучитьОбласть("Строка");
	ОбластьРаздел 	 = Макет.ПолучитьОбласть("Раздел");
	ТабДок.Очистить();

	// заголовок
	ОбластьЗаголовок.Параметры.Год = Формат(ПараметрыПечати.Год, "ЧГ=");
	ОбластьЗаголовок.Параметры.НаименованиеПредприятия = РаботаСОрганизациями.ПолучитьНаименованиеОрганизации(ПараметрыПечати.Организация);
	ОбластьЗаголовок.Параметры.Руководитель = РаботаСОрганизациями.ПолучитьОтветсвенноеЛицо("Руководитель", ПараметрыПечати.Организация, Дата(ПараметрыПечати.Год, 1, 1));
	ТабДок.Вывести(ОбластьЗаголовок);
	
	// шапка
	ТабДок.Вывести(ОбластьШапка);
	
	// разделы
	Пока ВыборкаРазделы.Следующий() Цикл
		
		ОбластьРаздел.Параметры.Индекс = ВыборкаРазделы.Раздел.Индекс;
		ОбластьРаздел.Параметры.Наименование = ВыборкаРазделы.Раздел.Наименование;
		ТабДок.Вывести(ОбластьРаздел);
		
		// строки
		ВыборкаСтроки = ВыборкаРазделы.Выбрать();
		Пока ВыборкаСтроки.Следующий() Цикл
			ОбластьСтрока.Параметры.Заполнить(ВыборкаСтроки);
			
			НомераСтатей = ВыборкаСтроки.НомераСтатей;
			СрокХранения = ВыборкаСтроки.СрокХранения;
			ОтметкаЭПК 	 = ВыборкаСтроки.ОтметкаЭПК;
			
			Если ТипЗнч(СрокХранения) = Тип("Число") Тогда 
				ОбластьСтрока.Параметры.СрокХраненияНомераСтатей = Строка(СрокХранения) + " "
					+ ДелопроизводствоКлиентСервер.ПодписьЛет(СрокХранения) 
					+ ?(ОтметкаЭПК, " ЭПК", "") 
					+ ?(ЗначениеЗаполнено(НомераСтатей), ", " + НомераСтатей, "");
			Иначе
				ОбластьСтрока.Параметры.СрокХраненияНомераСтатей = СрокХранения 
					+ ?(ОтметкаЭПК, " ЭПК", "")
					+ ?(ЗначениеЗаполнено(НомераСтатей), ", " + НомераСтатей, "");
			КонецЕсли;
			
			ТабДок.Вывести(ОбластьСтрока);
		КонецЦикла;	
	КонецЦикла;
	
КонецПроцедуры

Процедура ПечатьИтоговойЗаписи(ТабДок, ПараметрыПечати) Экспорт
	
	Макет = Справочники.НоменклатураДел.ПолучитьМакет("ИтоговаяЗапись");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Дела.НоменклатураДел.КатегорияДела КАК КатегорияДела,
	|	СУММА(1) КАК Всего,
	|	СУММА(ВЫБОР
	|			КОГДА Дела.НоменклатураДел.ОтметкаЭПК
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СОтметкойЭПК,
	|	СУММА(ВЫБОР
	|			КОГДА Дела.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
	|					И ГОД(Дела.ДатаОкончания) <> &Год
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Переходящих
	|ИЗ
	|	Справочник.ДелаХраненияДокументов КАК Дела
	|ГДЕ
	|	Дела.НоменклатураДел.Год = &Год
	|	И (Дела.НоменклатураДел.Организация = &Организация
	|			ИЛИ &ИспользоватьУчетПоОрганизациям = ЛОЖЬ)
	|
	|СГРУППИРОВАТЬ ПО
	|	Дела.НоменклатураДел.КатегорияДела";
	Запрос.УстановитьПараметр("Год", ПараметрыПечати.Год);
	Запрос.УстановитьПараметр("Организация", ПараметрыПечати.Организация);
	Запрос.УстановитьПараметр("ИспользоватьУчетПоОрганизациям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОрганизациям"));
	
	Выборка = Запрос.Выполнить().Выгрузить();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка 	 = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока 	 = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал 	 = Макет.ПолучитьОбласть("Подвал");
	ТабДок.Очистить();

	// заголовок
	ОбластьЗаголовок.Параметры.Год = Формат(ПараметрыПечати.Год, "ЧГ=");
	ТабДок.Вывести(ОбластьЗаголовок);
	
	// шапка
	ТабДок.Вывести(ОбластьШапка);
	
	// строки
	ОбластьСтрока.Параметры.КатегорияДелаСтр = "Постоянного";
	НайденнаяСтрока = Выборка.Найти(Перечисления.КатегорииДел.Постоянное, "КатегорияДела");
	Если НайденнаяСтрока <> Неопределено Тогда 
		ОбластьСтрока.Параметры.Заполнить(НайденнаяСтрока);
	КонецЕсли;	
	ТабДок.Вывести(ОбластьСтрока);
	
	ОбластьСтрока.Параметры.КатегорияДелаСтр = "Временного (свыше 10 лет)";
	НайденнаяСтрока = Выборка.Найти(Перечисления.КатегорииДел.ВременноеСвыше10, "КатегорияДела");
	Если НайденнаяСтрока <> Неопределено Тогда 
		ОбластьСтрока.Параметры.Заполнить(НайденнаяСтрока);
	КонецЕсли;	
	ТабДок.Вывести(ОбластьСтрока);
		
	ОбластьСтрока.Параметры.КатегорияДелаСтр = "Временного (до 10 лет включительно)";
	НайденнаяСтрока = Выборка.Найти(Перечисления.КатегорииДел.ВременноеДо10, "КатегорияДела");
	Если НайденнаяСтрока <> Неопределено Тогда 
		ОбластьСтрока.Параметры.Заполнить(НайденнаяСтрока);
	КонецЕсли;	
	ТабДок.Вывести(ОбластьСтрока);	
		
	// подвал
	ДатаПодписи = ТекущаяДата();
	РуководительСлужбыДОУ = РаботаСОрганизациями.ПолучитьОтветсвенноеЛицо("РуководительСлужбыДОУ", ПараметрыПечати.Организация, ДатаПодписи);
	
	ОбластьПодвал.Параметры.РуководительДОУ = РуководительСлужбыДОУ;
	ОбластьПодвал.Параметры.ДолжностьРуководителяДОУ = РаботаСПользователями.ПолучитьДолжность(РуководительСлужбыДОУ);
	ОбластьПодвал.Параметры.ДатаПодписи = ДатаПодписи;
	ТабДок.Вывести(ОбластьПодвал);
	
КонецПроцедуры
